In [17]:
import pandas as pd
import numpy as np

daily_index = pd.date_range("2023-01-01", periods=365, freq="D")
sales_data = np.random.randint(100, 2000, size=len(daily_index))
sales_df = pd.DataFrame({"Sales" : sales_data}, index=daily_index)

sales_df

            Sales
2023-01-01    281
2023-01-02    872
2023-01-03   1576
2023-01-04    732
2023-01-05    273
...           ...
2023-12-27    533
2023-12-28    747
2023-12-29   1357
2023-12-30    852
2023-12-31    688

[365 rows x 1 columns]

In [20]:
sales_total_resampled = sales_df.resample('M').sum()
sales_total_resampled

            Sales
2023-01-31  31495
2023-02-28  34051
2023-03-31  33902
2023-04-30  32539
2023-05-31  33022
2023-06-30  32929
2023-07-31  32535
2023-08-31  25757
2023-09-30  30160
2023-10-31  30539
2023-11-30  27513
2023-12-31  36745

In [34]:
import pandas as pd
import numpy as np

date_series = pd.to_datetime(['2025-01-01','2025-02-01','2025-03-01','2025-04-01','2025-05-01'] * 3)
region_series = ['North'] * 5 + ['South'] * 5 + ['East'] * 5
region_sales_data = np.random.randint(100, 2000, size=15)
region_sales_df = pd.DataFrame({'Date': date_series,
                                'Region': region_series,
                                'Sales': region_sales_data})
region_sales_df

         Date Region  Sales
0  2025-01-01  North   1090
1  2025-02-01  North   1513
2  2025-03-01  North    124
3  2025-04-01  North    555
4  2025-05-01  North   1388
5  2025-01-01  South   1699
6  2025-02-01  South   1270
7  2025-03-01  South   1586
8  2025-04-01  South   1297
9  2025-05-01  South   1282
10 2025-01-01   East    508
11 2025-02-01   East    800
12 2025-03-01   East    791
13 2025-04-01   East   1091
14 2025-05-01   East    390

In [32]:
pivot_result = region_sales_df.pivot(index="Date",columns="Region",values="Sales")
pivot_result

Region      East  North  South
Date
2025-01-01  1374   1691   1327
2025-02-01   414   1827    618
2025-03-01   652    606    991
2025-04-01  1678   1301    822
2025-05-01   519   1763   1814

In [ ]:
import pandas as pd

tips = pd.read_csv("../data/tips.csv")
tips.head(10)

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4
5       25.29  4.71     No  Sun  Dinner     4
6        8.77  2.00     No  Sun  Dinner     2
7       26.88  3.12     No  Sun  Dinner     4
8       15.04  1.96     No  Sun  Dinner     2
9       14.78  3.23     No  Sun  Dinner     2

In [41]:
tips_pivot = tips.pivot_table(index="day", columns="time", values="total_bill", aggfunc="mean", margins=True)
tips_pivot

time     Dinner      Lunch        All
day
Fri   19.663333  12.845714  17.151579
Sat   20.441379        NaN  20.441379
Sun   21.410000        NaN  21.410000
Thur  18.780000  17.664754  17.682742
All   20.797159  17.168676  19.785943